################################################################################
### Taps
################################################################################

tap "homebrew/bundle"
tap "homebrew/cask"

tap "azure/kubelogin"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "jetbrains/utils"
tap "stripe/stripe-cli"
tap "supabase/tap"

################################################################################
### Applications
################################################################################

cask "ghostty"

################################################################################
### Languages
################################################################################

brew "deno"
brew "go"
# After node was installed we have to link it and we have to install yarn:
#   brew link --force --overwrite node@22
brew "node@22"

################################################################################
### Language Servers and Linters
################################################################################

brew "efm-langserver"
brew "golangci-lint"
brew "hashicorp/tap/terraform-ls"
brew "helm-ls"
# brew "JetBrains/utils/kotlin-lsp"
# brew "ktlint"
brew "lua-language-server"
brew "marksman"

################################################################################
### Tools
################################################################################

brew "azure/kubelogin/kubelogin"
brew "btop"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "fluxcd/tap/flux"
brew "fzf"
brew "gh"
brew "grpcurl"
brew "hashicorp/tap/terraform"
brew "helm"
brew "jq"
brew "kind"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "krew"
brew "lcov"
brew "mage"
brew "operator-sdk"
brew "rclone"
brew "ripgrep"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "telnet"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "watch"
brew "wget"
brew "yazi"
brew "yq"
brew "zsh"
brew "zsh-completions"
