################################################################################
### Taps
################################################################################

tap "atlassian/homebrew-acli", trusted: true
tap "azure/kubelogin", trusted: true
tap "fluxcd/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "jetbrains/utils", trusted: true
tap "stripe/stripe-cli", trusted: true
tap "supabase/tap", trusted: true

################################################################################
### Applications
################################################################################

cask "ghostty"

################################################################################
### Languages
################################################################################

brew "deno"
brew "go"
# After node was installed we have to link it:
#   brew link --force --overwrite node@24
brew "node@24"
brew "ruby"

################################################################################
### Language Servers and Linters
################################################################################

brew "efm-langserver"
brew "golangci-lint"
brew "hashicorp/tap/terraform-ls"
brew "helm-ls"
# brew "JetBrains/utils/kotlin-lsp"
# brew "ktlint"
brew "lua-language-server"
brew "marksman"
brew "ruff"
brew "stylua"
brew "xcode-build-server"

################################################################################
### Tools
################################################################################

brew "acli"
brew "azure/kubelogin/kubelogin"
brew "bat"
brew "btop"
brew "fd"
brew "fluxcd/tap/flux"
brew "fzf"
brew "gh"
brew "grpcurl"
brew "hashicorp/tap/terraform"
brew "helm"
brew "istioctl"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "krew"
brew "lcov"
brew "mage"
brew "mise"
brew "anomalyco/tap/opencode"
brew "operator-sdk"
brew "rclone"
brew "ripgrep"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "telnet"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-completions"
