{
  "plugins": {
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim",
      "version": "'main'"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'main'"
    },
    "helm-ls": {
      "src": "https://github.com/qvalentin/helm-ls.nvim",
      "version": "'main'"
    },
    "lualine": {
      "src": "https://github.com/nvim-lualine/lualine.nvim",
      "version": "'master'"
    },
    "multicursor": {
      "src": "https://github.com/jake-stewart/multicursor.nvim",
      "version": "'main'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "sidekick": {
      "src": "https://github.com/folke/sidekick.nvim",
      "version": "'main'"
    },
    "snacks": {
      "src": "https://github.com/folke/snacks.nvim",
      "version": "'main'"
    }
  }
}
